In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
data = {
    'yil':[2021, 2020, 2019, 2018, 2017, 2016],
    'aholi soni':[33.9, 33.5, 32.9, 32.5, 31.9, 31.4],
    'temp':[1.54, 1.48, 1.56, 1.62, 1.165, 1.66],
    'zichlik':[79.77, 78.68, 77.54, 76.34, 75.13,73.91]
}
df =pd.DataFrame(data)
df

    yil  aholi soni   temp  zichlik
0  2021        33.9  1.540    79.77
1  2020        33.5  1.480    78.68
2  2019        32.9  1.560    77.54
3  2018        32.5  1.620    76.34
4  2017        31.9  1.165    75.13
5  2016        31.4  1.660    73.91

In [5]:
df.index=[21,20,19,18,17,16]
df

     yil  aholi soni   temp  zichlik
21  2021        33.9  1.540    79.77
20  2020        33.5  1.480    78.68
19  2019        32.9  1.560    77.54
18  2018        32.5  1.620    76.34
17  2017        31.9  1.165    75.13
16  2016        31.4  1.660    73.91

In [6]:


data=df['aholi soni'] # bitta [] qavs series holatida ajratgan bolsak
data

21    33.9
20    33.5
19    32.9
18    32.5
17    31.9
16    31.4
Name: aholi soni, dtype: float64

In [7]:
data1 = df[['aholi soni']] # datafream holatida ajratish uchun [[]] 2 ta qavsdan foydalanish kk
data1

    aholi soni
21        33.9
20        33.5
19        32.9
18        32.5
17        31.9
16        31.4

In [8]:
data

21    33.9
20    33.5
19    32.9
18    32.5
17    31.9
16    31.4
Name: aholi soni, dtype: float64

In [9]:
type(data[[21]])

pandas.core.series.Series

In [10]:
data[[21]]

21    33.9
Name: aholi soni, dtype: float64

In [11]:
data

21    33.9
20    33.5
19    32.9
18    32.5
17    31.9
16    31.4
Name: aholi soni, dtype: float64

In [12]:
obj = pd.Series(np.arange(6.), index=['a', 'b', 'c', 'd', 'e', 'f'])

In [13]:
type(obj)

pandas.core.series.Series

In [41]:
obj[obj>3]= 12

In [14]:
type(obj)

pandas.core.series.Series

In [16]:
obj['a':'f']

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
dtype: float64

In [45]:
data[1:4]

20    33.5
19    32.9
18    32.5
Name: aholi soni, dtype: float64

In [46]:
# DataFrame elementlarni tanlash

In [47]:
uzb = {2020:33.5, 2019:32.9, 2018:32.5, 2017:31.7, 2016:31.4}
kz = {2020:18.8, 2019:18.5, 2018:18.1, 2017:17.8}
tj = {2020:9.5, 2019:18.5, 2018:9.1, 2017:8.8}
kg = {2020:6.5, 2019:5.9, 2018:6.3, 2017:6.2}
tr = {2020:6.0, 2019:5.9, 2018:5.9, 2017:5.8}

df = pd.DataFrame(
{'uzbekistan':uzb,
 'kazakistan':kz,
 'tajikistan':tj,
 'kyrgizstan':kz,
 'turmenistan':tr
})

In [48]:
df

      uzbekistan  kazakistan  tajikistan  kyrgizstan  turmenistan
2020        33.5        18.8         9.5        18.8          6.0
2019        32.9        18.5        18.5        18.5          5.9
2018        32.5        18.1         9.1        18.1          5.9
2017        31.7        17.8         8.8        17.8          5.8
2016        31.4         NaN         NaN         NaN          NaN

In [49]:
df['uzbekistan'] # series korinishida

2020    33.5
2019    32.9
2018    32.5
2017    31.7
2016    31.4
Name: uzbekistan, dtype: float64

In [50]:
df[['uzbekistan']] # dataframe korinishda

      uzbekistan
2020        33.5
2019        32.9
2018        32.5
2017        31.7
2016        31.4

In [52]:
df[2:]

      uzbekistan  kazakistan  tajikistan  kyrgizstan  turmenistan
2018        32.5        18.1         9.1        18.1          5.9
2017        31.7        17.8         8.8        17.8          5.8
2016        31.4         NaN         NaN         NaN          NaN

In [55]:
df>7 # aholi sonini aniqlab filtirlab olish mumkin 7 mlndan kop aholi soni bor davlatlar true qiymat qaytaradi

      uzbekistan  kazakistan  tajikistan  kyrgizstan  turmenistan
2020        True        True        True        True        False
2019        True        True        True        True        False
2018        True        True        True        True        False
2017        True        True        True        True        False
2016        True       False       False       False        False

In [59]:
df

      uzbekistan  kazakistan  tajikistan  kyrgizstan  turmenistan
2020        33.5        18.8         9.5        18.8          6.0
2019        32.9        18.5        18.5        18.5          5.9
2018        32.5        18.1         9.1        18.1          5.9
2017        31.7        17.8         8.8        17.8          5.8
2016        31.4         NaN         NaN         NaN          NaN

In [58]:
df[['uzbekistan']][df['uzbekistan']>32] # uzb aholisi qachon 32mlndan oshganini aniq filtirlash

      uzbekistan
2020        33.5
2019        32.9
2018        32.5

In [61]:
dfuz = df[['uzbekistan']]
dfuz

      uzbekistan
2020        33.5
2019        32.9
2018        32.5
2017        31.7
2016        31.4

In [62]:
dfuz[dfuz['uzbekistan']>32] # mana shunday uzulham mavjud

      uzbekistan
2020        33.5
2019        32.9
2018        32.5

In [63]:
dfuz['uzbekistan']>32

2020     True
2019     True
2018     True
2017    False
2016    False
Name: uzbekistan, dtype: bool

In [64]:
df.T # ustunlar va qatorlar ornini alishtiramiz

             2020  2019  2018  2017  2016
uzbekistan   33.5  32.9  32.5  31.7  31.4
kazakistan   18.8  18.5  18.1  17.8   NaN
tajikistan    9.5  18.5   9.1   8.8   NaN
kyrgizstan   18.8  18.5  18.1  17.8   NaN
turmenistan   6.0   5.9   5.9   5.8   NaN

In [66]:
df2 = df.transpose(copy=True) # ustunlar va qatorlar ornini alishtiramiz
df2

             2020  2019  2018  2017  2016
uzbekistan   33.5  32.9  32.5  31.7  31.4
kazakistan   18.8  18.5  18.1  17.8   NaN
tajikistan    9.5  18.5   9.1   8.8   NaN
kyrgizstan   18.8  18.5  18.1  17.8   NaN
turmenistan   6.0   5.9   5.9   5.8   NaN

In [79]:
df2[df2[2017]>9] # 2017-yilda aholisi 7 mlndan kop davlatlarni chiqazish kk bolganda

            2020  2019  2018  2017  2016
uzbekistan  33.5  32.9  32.5  31.7  31.4
kazakistan  18.8  18.5  18.1  17.8   NaN
kyrgizstan  18.8  18.5  18.1  17.8   NaN

In [80]:
#.loc/.iloc/va .at/.iat

In [81]:
df

      uzbekistan  kazakistan  tajikistan  kyrgizstan  turmenistan
2020        33.5        18.8         9.5        18.8          6.0
2019        32.9        18.5        18.5        18.5          5.9
2018        32.5        18.1         9.1        18.1          5.9
2017        31.7        17.8         8.8        17.8          5.8
2016        31.4         NaN         NaN         NaN          NaN

In [83]:
df.loc[[2017,2019]]# qatorlarni chiqarsih

      uzbekistan  kazakistan  tajikistan  kyrgizstan  turmenistan
2017        31.7        17.8         8.8        17.8          5.8
2019        32.9        18.5        18.5        18.5          5.9

In [85]:
df.loc[[2017,2019],['uzbekistan','tajikistan']]# qator va ustunlarga murojat qilmoqchi bolsak

      uzbekistan  tajikistan
2017        31.7         8.8
2019        32.9        18.5

In [86]:
df.iloc[[0,4]] # tartib raqami bn murojat qilishda iloc yani i index degani

      uzbekistan  kazakistan  tajikistan  kyrgizstan  turmenistan
2020        33.5        18.8         9.5        18.8          6.0
2016        31.4         NaN         NaN         NaN          NaN

In [87]:
df

      uzbekistan  kazakistan  tajikistan  kyrgizstan  turmenistan
2020        33.5        18.8         9.5        18.8          6.0
2019        32.9        18.5        18.5        18.5          5.9
2018        32.5        18.1         9.1        18.1          5.9
2017        31.7        17.8         8.8        17.8          5.8
2016        31.4         NaN         NaN         NaN          NaN

In [88]:
df.at[2017,'uzbekistan'] # at yordamida faqatgina bitta malumot olishda ishlatiladi

31.7

In [89]:
df.at[2020,'uzbekistan']-df.at[2017,'uzbekistan'] # arifmetik amallarham bajara olamiz

1.8000000000000007

In [17]:
df.iat[2,1] # qator va ustunlar ornini kiritish orqali malumotlarga ega bolishimiz mumkin

32.9

In [18]:
nums = list(range(10,21))

In [19]:
nums

[10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [21]:
nums[0]

10

In [20]:
obj = pd.Series(np.arange(10.))
obj

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [22]:
obj[0]

0.0

In [26]:
obj.iloc[-1]

9.0

In [24]:
ser = pd.Series(np.arange(3.),index=['a','b','c'])
ser

a    0.0
b    1.0
c    2.0
dtype: float64

In [25]:
ser[-1]

2.0